In [19]:
import pandas as pd
import numpy as np
import seaborn as sns

### Let's import our data!

In [9]:
df = pd.read_csv('./Data/train.csv') ## Train data
df.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
0,1379560,1,55,1885,136.83,152.29,0,0,177
1,1466964,1,55,1993,136.83,135.83,0,0,270
2,1346989,1,55,2539,134.86,135.86,0,0,189
3,1338232,1,55,2139,339.50,437.53,0,0,54
4,1448490,1,55,2631,243.50,242.50,0,0,40

In [11]:
fc = pd.read_csv('./Data/fulfilment_center_info.csv') ## fulfilment_center_info
fc.head()

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6

In [12]:
mi = pd.read_csv('./Data/meal_info.csv') ## meal_info
mi.head()

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai
3     1248  Beverages  Indian
4     2631  Beverages  Indian

### Let's Understand our data

### Fullfilment Center

In [17]:
print(fc.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   center_id    77 non-null     int64
 1   city_code    77 non-null     int64
 2   region_code  77 non-null     int64
 3   center_type  77 non-null     object
 4   op_area      77 non-null     float64
dtypes: float64(1), int64(3), object(1)
memory usage: 3.1+ KB
None

In [18]:
fc.describe().T

             count        mean        std    min    25%    50%    75%    max
center_id     77.0   83.142857  46.090219   10.0   50.0   77.0  110.0  186.0
city_code     77.0  600.662338  66.720274  456.0  553.0  596.0  651.0  713.0
region_code   77.0   56.493506  18.126473   23.0   34.0   56.0   77.0   93.0
op_area       77.0    3.985714   1.106406    0.9    3.5    3.9    4.4    7.0

In [ ]:
sns.fc.op_area